using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 * Царёв ВА
 * 
 * 1.	Реализовать простейшую хэш-функцию. На вход функции подается строка, 
 * на выходе получается сумма кодов символов.
 * 
 * 2.	Переписать программу, реализующее двоичное дерево поиска:
 * a.	Добавить в него обход дерева различными способами.
 * b.	Реализовать поиск в нём.
 * c.	*Добавить в программу обработку командной строки с помощью которой 
 * можно указывать, из какого файла считывать данные, каким образом обходить дерево.
 * 
 * 3.	Разработать базу данных студентов, состоящую из полей «Имя», «Возраст»,
 * «Табельный номер», в которой использовать все знания, полученные на уроках.
 * Данные следует считать в двоичное дерево поиска. Реализовать поиск по какому-нибудь
 * полю базы данных.
 * 
 */

namespace _1
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
