using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/*
 * Царёв ВА
 * 
 * 1. Реализовать перевод из 10 в 2 систему счисления с использованием стека.
 * 
 * 2. Добавить в программу “реализация стека на основе односвязного списка” 
 * проверку на выделение памяти. Если память не выделяется,
 * то выводится соответствующее сообщение. Постарайтесь создать ситуацию,
 * когда память не будет выделяться (добавлением большого количества данных).
 * 
 * 3. Написать программу, которая определяет, является ли введенная скобочная
 * последовательность правильной. Примеры правильных скобочных выражений:
 * (), ([])(), {}(), ([{}]), неправильных — )(, ())({), (, ])}), ([(]) для скобок [,(,{.
 * Например: (2+(2*2)) или [2/{5*(4+7)}]
 * 
 * 4. *Создать функцию, копирующую односвязный список (то есть создает в памяти 
 * копию односвязного списка, без удаления первого списка).
 * 
 * 5. **Реализовать алгоритм перевода из инфиксной записи арифметического
 * выражения в постфиксную.
 * 
 * 6. *Реализовать очередь.
 * 
 */

namespace _1
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
